In [1]:
import pandas as pd
import numpy as np

In [2]:
# Creating a Pandas Series
data = [10, 20, 30, 40, 50]
series = pd.Series(data, index=['a', 'b', 'c', 'd', 'e'])
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [3]:
# Accessing elements in Series 
print("Accessing a single element in Series:", series ['b']) 
print("Accessing multiple elements:") 
print(series [['b', 'd']])

Accessing a single element in Series: 20
Accessing multiple elements:
b    20
d    40
dtype: int64

In [5]:
# Creating a Pandas DataFram 
data_dict={'Name': ['Alice', 'Bob', 'Charlie', 'David'],
           'Age': [25, 30, 35, 40],
           'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']} 
df = pd.DataFrame(data_dict) 
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [6]:
#Adding a new column 
df['Salary'] = [50000, 60000, 70000, 80000] 
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
3    David   40      Houston   80000

In [8]:
# Selecting specific columns
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [9]:
# Selecting multiple columns 
print(df[['Name', 'Age']])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40